socialNetwork/wrk2/user-timeline-without-istio/COMMAND_69/207
Running 1m test @ http://localhost:31111/wrk2-api/user-timeline/read
  8 threads and 8 connections
  Thread calibration: mean lat.: 0.244ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.273ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.232ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.260ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.197ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.219ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.210ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.227ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   227.09us  150.98us 488.00us   96.34%
    Req/Sec   132.50     47.80   222.00     74.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  212.00us
 75.000%  253.00us
 90.000%  314.00us
 99.000%  488.00us
 99.900%    1.01ms
 99.990%    5.76ms
 99.999%   10.94ms
100.000%   10.94ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.061     0.000000            1         1.00
       0.153     0.100000         5164         1.11
       0.168     0.200000        10311         1.25
       0.181     0.300000        15224         1.43
       0.196     0.400000        20226         1.67
       0.212     0.500000        25130         2.00
       0.220     0.550000        27687         2.22
       0.228     0.600000        30275         2.50
       0.235     0.650000        32525         2.86
       0.243     0.700000        35032         3.33
       0.253     0.750000        37601         4.00
       0.259     0.775000        38939         4.44
       0.265     0.800000        40129         5.00
       0.272     0.825000        41305         5.71
       0.282     0.850000        42509         6.67
       0.296     0.875000        43817         8.00
       0.304     0.887500        44411         8.89
       0.314     0.900000        45056        10.00
       0.324     0.912500        45667        11.43
       0.334     0.925000        46283        13.33
       0.346     0.937500        46916        16.00
       0.352     0.943750        47208        17.78
       0.359     0.950000        47503        20.00
       0.368     0.956250        47834        22.86
       0.378     0.962500        48149        26.67
       0.389     0.968750        48439        32.00
       0.397     0.971875        48608        35.56
       0.404     0.975000        48749        40.00
       0.415     0.978125        48909        45.71
       0.426     0.981250        49061        53.33
       0.444     0.984375        49219        64.00
       0.453     0.985938        49305        71.11
       0.464     0.987500        49378        80.00
       0.477     0.989062        49456        91.43
       0.493     0.990625        49533       106.67
       0.513     0.992188        49608       128.00
       0.524     0.992969        49648       142.22
       0.546     0.993750        49687       160.00
       0.570     0.994531        49725       182.86
       0.602     0.995313        49765       213.33
       0.628     0.996094        49803       256.00
       0.653     0.996484        49823       284.44
       0.675     0.996875        49843       320.00
       0.702     0.997266        49863       365.71
       0.732     0.997656        49881       426.67
       0.781     0.998047        49901       512.00
       0.802     0.998242        49911       568.89
       0.839     0.998437        49920       640.00
       0.878     0.998633        49930       731.43
       0.913     0.998828        49940       853.33
       1.037     0.999023        49950      1024.00
       1.257     0.999121        49955      1137.78
       1.480     0.999219        49959      1280.00
       2.161     0.999316        49964      1462.86
       2.537     0.999414        49969      1706.67
       2.875     0.999512        49974      2048.00
       2.997     0.999561        49977      2275.56
       3.293     0.999609        49979      2560.00
       3.507     0.999658        49981      2925.71
       3.743     0.999707        49984      3413.33
       4.335     0.999756        49986      4096.00
       4.611     0.999780        49988      4551.11
       4.691     0.999805        49989      5120.00
       4.951     0.999829        49990      5851.43
       5.099     0.999854        49991      6826.67
       5.227     0.999878        49992      8192.00
       5.755     0.999890        49993      9102.22
       9.167     0.999902        49994     10240.00
       9.167     0.999915        49994     11702.86
      10.239     0.999927        49995     13653.33
      10.239     0.999939        49995     16384.00
      10.311     0.999945        49996     18204.44
      10.311     0.999951        49996     20480.00
      10.311     0.999957        49996     23405.71
      10.319     0.999963        49997     27306.67
      10.319     0.999969        49997     32768.00
      10.319     0.999973        49997     36408.89
      10.319     0.999976        49997     40960.00
      10.319     0.999979        49997     46811.43
      10.935     0.999982        49998     54613.33
      10.935     1.000000        49998          inf
#[Mean    =        0.227, StdDeviation   =        0.151]
#[Max     =       10.928, Total count    =        49998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59996 requests in 1.00m, 12.59MB read
  Non-2xx or 3xx responses: 59996
Requests/sec:    999.91
Transfer/sec:    214.83KB